divyamSoni/nucleo-STM32F767zi/Bare-metal/19-LCD_8-bit_mode_string/main.c
#include "stm32f7xx.h"                  // Device header

/*

PD0 - PD7 = D0 - D7 
PB15 				= R/S
PB13				= R/W
PB12				= EN

*/

static unsigned RS = 0x8000;			// 1000 0000 0000 0000
static unsigned RW = 0x2000;			// 0010 0000 0000 0000
static unsigned EN = 0x1000;			// 0001 0000 0000 0000

void GPIOInit(void);
void lcd_command(unsigned char command);
void lcd_data(char data);
void lcd_string(char s[]);
void lcd_init(void);
void sysTickDelayMs(int n);

int main(void){
	GPIOInit();
	lcd_init();
	
	while(1){
		
		lcd_command(0x80);			// Write on Line 1
		lcd_string("RG2004a: 20x4 LCD");
		
		lcd_command(0xc0);			// Write on Line 2
		lcd_string("Hello World!");
		
		lcd_command(0x94);			// Write on Line 3
		lcd_string("Hitachi: HD44780");
		
		lcd_command(0xd4);			// Write on Line 4
		lcd_string("8-bit,5x8 Dot Matrix");
		
		sysTickDelayMs(1000);
		lcd_command(1);					// Display clear
	}
}

void lcd_init(void){
	
	// Init sequence
	sysTickDelayMs(30);
	lcd_command(0x30);
	sysTickDelayMs(10);
	lcd_command(0x30);
	sysTickDelayMs(10);
	lcd_command(0x30);
	
	/* RG2004a 20x4 LCD
	Character Font = 5x8
	*/
	lcd_command(0x38);	// 8 bit, 2 line, 5x8 dot
	lcd_command(0x08);	// Display off
	lcd_command(0x01);	// Display clear
	lcd_command(0x04);	// Entry mode set
	lcd_command(0x0F);	// Function set

}

void GPIOInit(void){
	
	RCC->AHB1ENR |= 0x0A;				// Enable clock access to GPIO B,D
	GPIOB->MODER |= (1<<30)|(1<<26)|(1<<24); 	// Set PB12,13,15 as output
	GPIOB->BSRR 	= (EN|RW)<<16;			// Set EN and RW low (PB12, PB13)
	GPIOD->MODER |= 0x5555;				// Set PD0 - PD7 as output

}

void lcd_command(unsigned char command){

	GPIOB->BSRR = (RS|RW)<<16;			// RS = RW = 0
	GPIOD->ODR = command;
	GPIOB->BSRR = EN;				// E = 1
	sysTickDelayMs(50);
	GPIOB->BSRR = EN<<16;				// E = 0

}

void lcd_string(char s[]){				//Pass single letter till end is reached
	int len;
  for (len = 0; s[len] != '\0'; ++len){
		lcd_data(s[len]);
	}
}

void lcd_data(char data){
	
	GPIOB->BSRR = RS;					// RS = 1
	GPIOB->BSRR = RW<<16;					// RW = 0
	GPIOD->ODR = data;					// Pass data
	GPIOB->BSRR = EN;					// EN = 1
	sysTickDelayMs(30);
	GPIOB->BSRR = EN<<16;					// EN = 0

}

void sysTickDelayMs(int n){
	// Clock 16 MHz
	SysTick->LOAD = 16000; 		// Load with number of clocks per milisecond
	SysTick->VAL = 0;		// Clear current value register
	SysTick->CTRL = 0x5;		// Enable SysTick

	for(int i = 0; i<n; i++){
		// Wait until the count flag is set
		while((SysTick->CTRL & 0x10000) == 0){}
	}
	SysTick->CTRL = 0;
}
